In [140]:
def pie_chart(dictionary):
    values = list(dictionary.values())
#     print(values)
    parts = 360/sum(dictionary.values())
#     print(parts)

    j = 0
    for i in dictionary.keys():


        dictionary[i] = parts * values[j]
        j +=1
        
    return(dictionary)

In [141]:
pie_chart({ "a": 8, "b": 21, "c": 12, "d": 5, "e": 4 })

{'a': 57.6, 'b': 151.20000000000002, 'c': 86.4, 'd': 36.0, 'e': 28.8}

In [135]:
dictionary = { "a": 1, "b": 2 }
values = list(dictionary.values())
print(values)
parts = 360/sum(dictionary.values())
print(parts)

j = 0
for i in dictionary.keys():
    print (i)
    print(dictionary[i])
    print(values[j])
   
    dictionary[i] = parts * values[j]
    j +=1
    print(dictionary[i])
dictionary

[1, 2]
120.0
a
1
1
120.0
b
2
2
240.0

{'a': 120.0, 'b': 240.0}

In [124]:
dictionary = { "a": 1, "b": 2 }
keys = list(dictionary)
print(keys)
values = list(dictionary.values())
print(values)
parts = 360/sum(dictionary.values())
new_values = []
for i in dictionary:
    new_values.append(parts * values[i])
new_values

['a', 'b']
[1, 2]

TypeError: list indices must be integers or slices, not str

In [26]:
pie_chart({ "a": 1, "b": 2 })

TypeError: list indices must be integers or slices, not str

In [22]:
a = { "a": 1, "b": 2 }
list(a)

['a', 'b']

TypeError: unsupported operand type(s) for *: 'float' and 'dict_values'

In [5]:
30 + 15 + 55
100/360 *30

108 +54 +198

360

In [ ]:
pie_chart({ "a": 1, "b": 2 }) ➞ { "a": 120, "b": 240 }

In [10]:
a = { "a": 1, "b": 2 }
v = a.values()
v

dict_values([1, 2])

In [13]:
new_values = sum(v)

In [14]:
new_values

3

In [15]:
360/3

120.0

## 1

In [ ]:
Create a function that performs an even-odd transform to a list, n times. 
Each even-odd transformation:
    - Adds 2(+2) to each odd integer.
    - Subtracts 2 (-2) to each even integer.
    
[3, 4, 9] => [5, 2, 11] => [7, 0, 13] => [9, -2, 15]

even_odd_transform([1, 2, 3], 1) ➞ [3, 0, 5]

In [43]:
def even_odd_transform(lst,repeat):

    for j in range(repeat):
        for i in range(len(lst)):
            if lst[i]%2 == 0: # even
        #         print('even' lst[i]
                lst[i] -=2
            else:
                lst[i] +=2
    return(lst)

In [44]:
even_odd_transform([0, 0, 0], 10)

[-20, -20, -20]

In [45]:
even_odd_transform([1, 2, 3], 1)

[3, 0, 5]

In [51]:
import pandas as pd
import sys
# from supporting_files.data_loader import load_excel

df = pd.read_excel('SaleData.xlsx')


"""
Write a Pandas program to find the total sale amount (Sale_amt) region and manager wise. 
Order the dataframe by Sale_amt, starting with the highest.
Output should be DataFrame with 3 columns (order is important):
    - Region
    - Manager
    - Sale_amt
and numeric index starting with 0 (after sorting).
"""

def compute_total_sale(df):
    "IMPLEMENT ME"

In [53]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36.0,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.0,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56.0,1198.0,67088.0

In [59]:
df['Region','Manager','Sale_amt'].groupby(['Region', 'Manager']

SyntaxError: unexpected EOF while parsing (3712791669.py, line 1)

In [123]:
df[['Region','Manager','Sale_amt']].groupby(['Region', 'Manager']).agg(Sale_amt= ('Sale_amt', 'sum')).sort_values('Sale_amt', ascending=False).reset_index()

    Region  Manager  Sale_amt
0  Central  Hermann  365108.5
1     East   Martha  272803.0
2  Central   Martha  199690.0
3  Central  Timothy  140955.0
4  Central  Douglas  124016.0
5     West  Timothy   88063.0
6     West  Douglas   66836.0
7     East  Douglas   48204.0

In [119]:
# df[['Region','Manager','Sale_amt']].groupby(['Region', 'Manager'], as_index=False).sum() .sort_value - reindex

df[['Region','Manager','Sale_amt']].groupby(['Region', 'Manager']).agg('Sale_amt', 'sum').sort_values('Sale_amt', ascending=False).reset_index()

# df.groupby('Manager').agg(sale_cnt = ('Item', 'count'),
#                                      sale_mean = ('Sale_amt', 'mean')).sort_values('sale_cnt', ascending=False).reset_index()

AssertionError:

# 3

In [ ]:
Write a function to count the manager wise sale (sale_cnt)
and mean value of sale amount (sale_mean). 
Order the output dataframe by sale_cnt, starting with the highest.
Output should be DataFrame with 3 columns (order is important):
    - Manager
    - sale_cnt
    - sale_mean
and numeric index starting with 0 (after sorting).

In [96]:
# df[['Region','Manager','Sale_amt']].groupby(['Region', 'Manager'], as_index=False).sum()
df.head()
df['sale_cnt'] = 0
df['sale_mean'] = 0
df.head(2)

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,sale_cnt,sale_mean
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0,0,0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0,0,0

In [117]:
df.groupby('Manager').agg(sale_cnt = ('Item', 'count'),
                                     sale_mean = ('Sale_amt', 'mean')).sort_values('sale_cnt', ascending=False).reset_index()

   Manager  sale_cnt     sale_mean
0   Martha        14  33749.500000
1  Hermann        12  30425.708333
2  Timothy         9  25446.444444
3  Douglas         8  29882.000000

In [111]:
man = df.groupby('Manager').sum()
man

         Units  Unit_price  Sale_amt  sale_cnt  sale_mean
Manager
Douglas  415.0      4304.5  239056.0         0          0
Hermann  647.0      5953.0  365108.5         0          0
Martha   704.0      9057.0  472493.0         0          0
Timothy  355.0      5669.0  229018.0         0          0

In [112]:
man['sale_cnt'] =df.groupby('Manager').count()
man['sale_mean']=df.groupby('Manager').mean()
man

         Units  Unit_price  Sale_amt  sale_cnt  sale_mean
Manager
Douglas  415.0      4304.5  239056.0         8  51.875000
Hermann  647.0      5953.0  365108.5        12  53.916667
Martha   704.0      9057.0  472493.0        14  50.285714
Timothy  355.0      5669.0  229018.0         9  39.444444

In [114]:
man = man[['sale_mean', 'sale_cnt']]

In [116]:
man.sort_values('sale_cnt', ascending=False)

         sale_mean  sale_cnt
Manager
Martha   50.285714        14
Hermann  53.916667        12
Timothy  39.444444         9
Douglas  51.875000         8

In [80]:
man.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,sale_cnt,sale_mean
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00,NaN,0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00,NaN,0
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00,NaN,0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00,NaN,0
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00,NaN,0
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00,NaN,0
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00,NaN,0
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00,NaN,0
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00,NaN,0
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00,NaN,0
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00,NaN,0
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00,NaN,0
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00,NaN,0
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00,NaN,0
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00,NaN,0
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00,NaN,0
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00,NaN,0
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00,NaN,0
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00,NaN,0
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00,NaN,0
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00,NaN,0
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75,NaN,0